<?php

/**
 * 状态码说明
 * 	   以下状态码均为六位纯数字、从1开始、如新加模块请顺序添加
 *     公共模块        110001
 *     考勤		       120001
 *     人员		       130001
 *     框架合同		   140001
 *     厂商		       150001
 *     合同订单		   160001
 */
return [
    //上传文件类错误
    110001 => "文件类型不允许",
    110002 => "文件太大",
    110003 => "文件数据为空",
    110004 => "文件标题与字典不对应",
    110005 => "部分信息导入失败",
    120001 => "用户id不存在",
    120002 => "请填写补卡原因",
    160001 => "合同订单id为空",
    160002 => "项目id为空",
    160003 => "已用金额超过订单总金额",
    160004 => "订单信息匹配配额表失败",
    160005 => "订单配额分配到子项目超支",
    160006 => "配额分配数据集中处理失败、未找到数据源",
    160007 => "订单配额批量更新失败",
];
